In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ········

# Lab | SQL Joins on multiple tables

In this lab, you will be using the [Sakila](https://dev.mysql.com/doc/sakila/en/) database of movie rentals.

### Instructions

1. Write a query to display for each store its store ID, city, and country.
2. Write a query to display how much business, in dollars, each store brought in.
3. What is the average running time of films by category?
4. Which film categories are longest?
5. Display the most frequently rented movies in descending order.
6. List the top five genres in gross revenue in descending order.
7. Is "Academy Dinosaur" available for rent from Store 1?

--------------------
1.Write a query to display for each store its store ID, city, and country.
-------------------

In [3]:
%%sql
select * from sakila.store
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 4, 57, 12))]

In [5]:
%%sql
select * from sakila.address
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\\\xc0v\x1f\xdb\x8d\x99\xd9H@', datetime.datetime(2014, 9, 25, 22, 30, 27))]

In [6]:
%%sql
select * from sakila.city
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'A Coruña (La Coruña)', 87, datetime.datetime(2006, 2, 15, 4, 45, 25))]

In [7]:
%%sql
select * from sakila.country
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'Afghanistan', datetime.datetime(2006, 2, 15, 4, 44))]

In [9]:
%%sql
select s.store_id, ci.city, co.country from sakila.store as s
join sakila.address as a on a.address_id = s.address_id
join sakila.city as ci on ci.city_id = a.city_id
join sakila.country as co on co.country_id = ci.country_id
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'Lethbridge', 'Canada'), (2, 'Woodridge', 'Australia')]

-----------
2.Write a query to display how much business, in dollars, each store brought in.
-------------

In [10]:
%%sql
select * from sakila.store
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 4, 57, 12))]

In [11]:
%%sql
select * from sakila.payment
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, 1, 76, Decimal('2.99'), datetime.datetime(2005, 5, 25, 11, 30, 37), datetime.datetime(2006, 2, 15, 22, 12, 30))]

In [12]:
%%sql
select * from sakila.customer
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20))]

In [13]:
%%sql
select c.store_id as tiendaid, sum(p.amount) as totamount
from sakila.customer as c
join sakila.payment as p on c.customer_id = p.customer_id
group by tiendaid
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, Decimal('36997.53')), (2, Decimal('30409.03'))]

--------------
3.What is the average running time of films by category?
----------

In [14]:
%%sql
select * from sakila.film
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', 'Deleted Scenes,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42))]

In [17]:
%%sql
select * from sakila.film_category
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 6, datetime.datetime(2006, 2, 15, 5, 7, 9))]

In [16]:
%%sql
select * from sakila.category
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'Action', datetime.datetime(2006, 2, 15, 4, 46, 27))]

In [20]:
%%sql
select c.name, avg(f.length)
from sakila.category as c
join sakila.film_category as fc on fc.category_id = c.category_id
join sakila.film as f on f.film_id = fc.film_id
group by c.name
order by avg(length) desc
limit 20;

 * mysql+pymysql://root:***@localhost/sakila
16 rows affected.

[('Sports', Decimal('128.2027')),
 ('Games', Decimal('127.8361')),
 ('Foreign', Decimal('121.6986')),
 ('Drama', Decimal('120.8387')),
 ('Comedy', Decimal('115.8276')),
 ('Family', Decimal('114.7826')),
 ('Music', Decimal('113.6471')),
 ('Travel', Decimal('113.3158')),
 ('Horror', Decimal('112.4821')),
 ('Classics', Decimal('111.6667')),
 ('Action', Decimal('111.6094')),
 ('New', Decimal('111.1270')),
 ('Animation', Decimal('111.0152')),
 ('Children', Decimal('109.8000')),
 ('Documentary', Decimal('108.7500')),
 ('Sci-Fi', Decimal('108.1967'))]

------
4.Which film categories are longest?
---------------

In [21]:
%%sql
select c.name, avg(f.length)
from sakila.category as c
join sakila.film_category as fc on fc.category_id = c.category_id
join sakila.film as f on f.film_id = fc.film_id
group by c.name
order by avg(length) desc
limit 20;

 * mysql+pymysql://root:***@localhost/sakila
16 rows affected.

[('Sports', Decimal('128.2027')),
 ('Games', Decimal('127.8361')),
 ('Foreign', Decimal('121.6986')),
 ('Drama', Decimal('120.8387')),
 ('Comedy', Decimal('115.8276')),
 ('Family', Decimal('114.7826')),
 ('Music', Decimal('113.6471')),
 ('Travel', Decimal('113.3158')),
 ('Horror', Decimal('112.4821')),
 ('Classics', Decimal('111.6667')),
 ('Action', Decimal('111.6094')),
 ('New', Decimal('111.1270')),
 ('Animation', Decimal('111.0152')),
 ('Children', Decimal('109.8000')),
 ('Documentary', Decimal('108.7500')),
 ('Sci-Fi', Decimal('108.1967'))]

---------------------
5.Display the most frequently rented movies in descending order.
--------------------

In [23]:
%%sql
select * from sakila.rental
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, datetime.datetime(2005, 5, 24, 22, 53, 30), 367, 130, datetime.datetime(2005, 5, 26, 22, 4, 30), 1, datetime.datetime(2006, 2, 15, 21, 30, 53))]

In [24]:
%%sql
select * from sakila.film
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', 'Deleted Scenes,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42))]

In [35]:
%%sql
select * from sakila.inventory
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 5, 9, 17))]

In [34]:
%%sql
select f.title, count(*) as suma
from sakila.inventory as i
join sakila.film as f on f.film_id = i.film_id
join sakila.rental as r on r.inventory_id = i.inventory_id
group by i.film_id
order by suma desc
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('BUCKET BROTHERHOOD', 34),
 ('ROCKETEER MOTHER', 33),
 ('GRIT CLOCKWORK', 32),
 ('FORWARD TEMPLE', 32),
 ('JUGGLER HARDLY', 32)]

----------
6.List the top five genres in gross revenue in descending order.
------------

In [43]:
%%sql
select * from sakila.inventory limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17))]

In [38]:
%%sql
select * from sakila.category limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'Action', datetime.datetime(2006, 2, 15, 4, 46, 27))]

In [40]:
%%sql
select * from sakila.payment limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, 1, 76, Decimal('2.99'), datetime.datetime(2005, 5, 25, 11, 30, 37), datetime.datetime(2006, 2, 15, 22, 12, 30))]

In [41]:
%%sql
select * from sakila.rental limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, datetime.datetime(2005, 5, 24, 22, 53, 30), 367, 130, datetime.datetime(2005, 5, 26, 22, 4, 30), 1, datetime.datetime(2006, 2, 15, 21, 30, 53))]

In [45]:
%%sql
select * from sakila.film_category limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 6, datetime.datetime(2006, 2, 15, 5, 7, 9))]

In [50]:
%%sql
select c.name, c.category_id, sum(p.amount)
from sakila.payment as p
join sakila.rental as r on r.rental_id = p.rental_id
join sakila.inventory as i on i.inventory_id = r.inventory_id
join sakila.film as f on f.film_id = i.film_id
join sakila.film_category as fc on fc.film_id = f.film_id
join sakila.category as c on c.category_id = fc.category_id
group by c.name
order by sum(p.amount) desc
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('Sports', 15, Decimal('5314.21')),
 ('Sci-Fi', 14, Decimal('4756.98')),
 ('Animation', 2, Decimal('4656.30')),
 ('Drama', 7, Decimal('4587.39')),
 ('Comedy', 5, Decimal('4383.58'))]